In [60]:
import pandas as pd
df = pd.read_csv("C:\\Users\\siddh\\OneDrive\\Desktop\\Machine_learning\\files\\titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [61]:
df.drop(['PassengerId' , 'Name' , 'SibSp' , 'Parch' , 'Ticket' , 'Cabin' , 'Embarked'] , inplace=True , axis="columns")
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [62]:
target = df.Survived
inputs = df.drop('Survived' , axis='columns')

In [63]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female   male
0   False   True
1    True  False
2    True  False

In [64]:
inputs = pd.concat([inputs,dummies] , axis="columns")
inputs.head(3)

   Pclass     Sex   Age     Fare  female   male
0       3    male  22.0   7.2500   False   True
1       1  female  38.0  71.2833    True  False
2       3  female  26.0   7.9250    True  False

In [65]:
inputs.drop('Sex' ,axis='columns' , inplace=True)
inputs

     Pclass   Age     Fare  female   male
0         3  22.0   7.2500   False   True
1         1  38.0  71.2833    True  False
2         3  26.0   7.9250    True  False
3         1  35.0  53.1000    True  False
4         3  35.0   8.0500   False   True
..      ...   ...      ...     ...    ...
886       2  27.0  13.0000   False   True
887       1  19.0  30.0000    True  False
888       3   NaN  23.4500    True  False
889       1  26.0  30.0000   False   True
890       3  32.0   7.7500   False   True

[891 rows x 5 columns]

In [66]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [67]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [68]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(5)

   Pclass   Age     Fare  female   male
0       3  22.0   7.2500   False   True
1       1  38.0  71.2833    True  False
2       3  26.0   7.9250    True  False
3       1  35.0  53.1000    True  False
4       3  35.0   8.0500   False   True

In [69]:
from sklearn.model_selection import train_test_split

In [70]:
X_train, X_test , y_train , y_test = train_test_split(inputs,target,test_size=0.2)

In [71]:
from sklearn.naive_bayes import GaussianNB

In [72]:
model = GaussianNB()
model.fit(X_train , y_train)

GaussianNB()

In [75]:
model.score(X_test,y_test)

0.8156424581005587

In [76]:
X_test[:10]

     Pclass        Age     Fare  female   male
582       2  54.000000  26.0000   False   True
229       3  29.699118  25.4667    True  False
250       3  29.699118   7.2500   False   True
310       1  24.000000  83.1583    True  False
623       3  21.000000   7.8542   False   True
780       3  13.000000   7.2292    True  False
39        3  14.000000  11.2417    True  False
476       2  34.000000  21.0000   False   True
98        2  34.000000  23.0000    True  False
2         3  26.000000   7.9250    True  False

In [77]:
y_test[:10]

582    0
229    0
250    0
310    1
623    0
780    1
39     1
476    0
98     1
2      1
Name: Survived, dtype: int64

In [78]:
model.predict(X_test[:10])

array([0, 1, 0, 1, 0, 1, 1, 0, 1, 1], dtype=int64)

In [79]:
model.predict_proba(X_test[:10])

array([[0.96942285, 0.03057715],
       [0.08961469, 0.91038531],
       [0.98931791, 0.01068209],
       [0.00165624, 0.99834376],
       [0.98725313, 0.01274687],
       [0.05979674, 0.94020326],
       [0.06316012, 0.93683988],
       [0.97713067, 0.02286933],
       [0.04432992, 0.95567008],
       [0.08777085, 0.91222915]])